@iameskild I believe I've solved this particular problem (Terraform trying to access localhost cluster) in the following issue. It has a corresponding PR - please review:

[Kubeconfig state unavailable, Terraform defaults to localhost](https://github.com/Quansight/qhub/issues/992)

However, (in AWS) it leads me to the problem you were seeing about subnet resources being replaced. (Some outputs below). Once it wants to replace the node groups, the apply will never finish since the nodes can't be destroyed until the cluster has its contents removed safely.

By the way, I tried the upgrade on AWS and got the same localhost error using password auth (not Auth0) - I don't think the auth type has anything to do with it, and you were just lucky if you got password upgrade to work before - or maybe something has changed since!

As discussed, the login problem you saw with Auth0 above is because the callback URL needs to be changed, and we need to advise the user in `qhub upgrade` - issue #991 for you.

<details>
<summary>Terraform AWS subnet replacement logs</summary>
```
[terraform]:   # module.kubernetes.aws_eks_cluster.main must be replaced
[terraform]: -/+ resource "aws_eks_cluster" "main" {
[terraform]:       ~ arn                       = "arn:aws:eks:eu-west-2:892486800165:cluster/qhubawsdslc-dev" -> (known after apply)
[terraform]:       ~ certificate_authority     = [
[terraform]:           - {
[terraform]:               - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ERXhOREE1TlRFd05Wb1hEVE15TURFeE1qQTVOVEV3TlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTVFUCjFnclQ0UFhZb1FwUXpGTVY3WHZ5bGtQdjg3ZTA3Nyt2SzhTZnpndkNmRFRrcVFLV093bDk1UmQ2RmtOS2JvMWQKY2cwL1ZSSVBkcWlBS0liVlBLWnVlcDE1UGEyUHNjNEZaRG5EMXdKd1BlMllPQWlmS2p3M1Z0dkxHRHVJZnF3Zgo0eHA5cm5IZHl6MytMMGdQaGZXaTZ3R3NZeUxJbmt0VUg2YzdGYlQzaUplbUEwTVI4dGVRZGVMaklac3BoMk9zCkNPMzFiYi84bEVrRlBZS2paZDhMNE9kM3ZzcnM2cURhbVh6ZWhCWDJpZlY1bWJuOW5iWnlLWGNXTTFaQmdaN2sKQ1ZxdjJLbytZaWZCeWlzTm15RHNpZjBMQW1Obk5Fa1RNclJudlREUmEvWGxSdkVJT3hBT054ZGdSU1JHekFsMApkOTJGSVhTUlpLaG1oS2VHM21VQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZMejlIUWtvSTEweTF0a0xYc0t4MUlWVW50aGdNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBYStjN2NkRCt0Qi9WblNlK1FJN2pyYnZ4WHNHbHVaRzZ4czRVdUluWXdTemFBRUU0egpOcVRybXh2WWJJYm43QUpGTU9jVW9pVTNFekVOMi85K1MrQ1VlWHp6WUdwOWFvUWR6NFR0Nlp5L2VxK083dFAzCnBTcUJnaTFRY1Z0MUdNcHNQYTBQS1dCVzl1TzVCZ3FmUE52UUVrWStab3dWZEJ4ZW9EL2Evb2hCSEgxSHFEbloKN2tGbTVXR2tOdHJabUU1ZUt0K1ExWjV6dWcvNGhpemc0UTdrMC9kR2FwcDlVaFN5ejQvaFpCOVp5VDNmanpFNgp6SnlWVHIyUHlRbzZma3BpSmJ2U2pqTlBDaFdVdXN6MzRZTVJFRDFFbjA3SVA5WDlaY1ZyUWpXajIyVmpBNnhoCkl6d1FmVmwzQnZXb3JsRFBHMVlZMDUzbzJWbXNkVVR5UFRXeQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
[terraform]:             },
[terraform]:         ] -> (known after apply)
[terraform]:       ~ created_at                = "2022-01-14 09:45:08.526 +0000 UTC" -> (known after apply)
[terraform]:       - enabled_cluster_log_types = [] -> null
[terraform]:       ~ endpoint                  = "https://6E72EBCB3DA4098E9A8F2EC38D1146A0.gr7.eu-west-2.eks.amazonaws.com" -> (known after apply)
[terraform]:       ~ id                        = "qhubawsdslc-dev" -> (known after apply)
[terraform]:       ~ identity                  = [
[terraform]:           - {
[terraform]:               - oidc = [
[terraform]:                   - {
[terraform]:                       - issuer = "https://oidc.eks.eu-west-2.amazonaws.com/id/6E72EBCB3DA4098E9A8F2EC38D1146A0"
[terraform]:                     },
[terraform]:                 ]
[terraform]:             },
[terraform]:         ] -> (known after apply)
[terraform]:         name                      = "qhubawsdslc-dev"
[terraform]:       ~ platform_version          = "eks.4" -> (known after apply)
[terraform]:       ~ status                    = "ACTIVE" -> (known after apply)
[terraform]:         tags                      = {
[terraform]:             "Environment" = "dev"
[terraform]:             "Name"        = "qhubawsdslc-dev"
[terraform]:             "Owner"       = "terraform"
[terraform]:             "Project"     = "qhubawsdslc"
[terraform]:         }
[terraform]:       ~ version                   = "1.21" -> (known after apply)
[terraform]:         # (2 unchanged attributes hidden)
[terraform]:
[terraform]:       ~ kubernetes_network_config {
[terraform]:           ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
[terraform]:         }
[terraform]:
[terraform]:       ~ vpc_config {
[terraform]:           ~ cluster_security_group_id = "sg-007603ed388248252" -> (known after apply)
[terraform]:           ~ public_access_cidrs       = [
[terraform]:               - "0.0.0.0/0",
[terraform]:             ] -> (known after apply)
[terraform]:           ~ subnet_ids                = [
[terraform]:               - "subnet-0063ecc4391bfbca7",
[terraform]:               - "subnet-0aede967b72f0907b",
[terraform]:             ] -> (known after apply) # forces replacement
[terraform]:           ~ vpc_id                    = "vpc-09af9d5ed405a83ed" -> (known after apply)
[terraform]:             # (3 unchanged attributes hidden)
[terraform]:         }
[terraform]:     }
[terraform]:
[terraform]:   # module.kubernetes.aws_eks_node_group.main[0] must be replaced
[terraform]: -/+ resource "aws_eks_node_group" "main" {
[terraform]:       ~ arn                    = "arn:aws:eks:eu-west-2:892486800165:nodegroup/qhubawsdslc-dev/general/14bf2c01-b6a2-2c2a-2b93-c9c96a608e41" -> (known after apply)
[terraform]:       ~ capacity_type          = "ON_DEMAND" -> (known after apply)
[terraform]:       ~ disk_size              = 20 -> 50 # forces replacement
[terraform]:       ~ id                     = "qhubawsdslc-dev:general" -> (known after apply)
[terraform]:       - labels                 = {} -> null
[terraform]:       + node_group_name_prefix = (known after apply)
[terraform]:       ~ release_version        = "1.21.5-20220112" -> (known after apply)
[terraform]:       ~ resources              = [
[terraform]:           - {
[terraform]:               - autoscaling_groups              = [
[terraform]:                   - {
[terraform]:                       - name = "eks-general-14bf2c01-b6a2-2c2a-2b93-c9c96a608e41"
[terraform]:                     },
[terraform]:                 ]
[terraform]:               - remote_access_security_group_id = ""
[terraform]:             },
[terraform]:         ] -> (known after apply)
[terraform]:       ~ status                 = "ACTIVE" -> (known after apply)
[terraform]:       ~ subnet_ids             = [
[terraform]:           - "subnet-0063ecc4391bfbca7",
[terraform]:           - "subnet-0aede967b72f0907b",
[terraform]:         ] -> (known after apply) # forces replacement
[terraform]:         tags                   = {
[terraform]:             "Environment"                           = "dev"
[terraform]:             "Owner"                                 = "terraform"
[terraform]:             "Project"                               = "qhubawsdslc"
[terraform]:             "kubernetes.io/cluster/qhubawsdslc-dev" = "shared"
[terraform]:         }
[terraform]:       ~ version                = "1.21" -> (known after apply)
[terraform]:         # (6 unchanged attributes hidden)
[terraform]:
[terraform]:
[terraform]:       ~ update_config {
[terraform]:           ~ max_unavailable            = 1 -> (known after apply)
[terraform]:           ~ max_unavailable_percentage = 0 -> (known after apply)
[terraform]:         }
[terraform]:         # (1 unchanged block hidden)
[terraform]:     }
[terraform]:
[terraform]:   # module.kubernetes.aws_eks_node_group.main[1] must be replaced
[terraform]: -/+ resource "aws_eks_node_group" "main" {
[terraform]:       ~ arn                    = "arn:aws:eks:eu-west-2:892486800165:nodegroup/qhubawsdslc-dev/user/06bf2c01-b6a2-7df4-2dd9-085b9d1c86fa" -> (known after apply)
[terraform]:       ~ capacity_type          = "ON_DEMAND" -> (known after apply)
[terraform]:       ~ disk_size              = 20 -> 50 # forces replacement
[terraform]:       ~ id                     = "qhubawsdslc-dev:user" -> (known after apply)
[terraform]:       - labels                 = {} -> null
[terraform]:       + node_group_name_prefix = (known after apply)
[terraform]:       ~ release_version        = "1.21.5-20220112" -> (known after apply)
[terraform]:       ~ resources              = [
[terraform]:           - {
[terraform]:               - autoscaling_groups              = [
[terraform]:                   - {
[terraform]:                       - name = "eks-user-06bf2c01-b6a2-7df4-2dd9-085b9d1c86fa"
[terraform]:                     },
[terraform]:                 ]
[terraform]:               - remote_access_security_group_id = ""
[terraform]:             },
[terraform]:         ] -> (known after apply)
[terraform]:       ~ status                 = "ACTIVE" -> (known after apply)
[terraform]:       ~ subnet_ids             = [
[terraform]:           - "subnet-0063ecc4391bfbca7",
[terraform]:           - "subnet-0aede967b72f0907b",
[terraform]:         ] -> (known after apply) # forces replacement
[terraform]:         tags                   = {
[terraform]:             "Environment"                           = "dev"
[terraform]:             "Owner"                                 = "terraform"
[terraform]:             "Project"                               = "qhubawsdslc"
[terraform]:             "kubernetes.io/cluster/qhubawsdslc-dev" = "shared"
[terraform]:         }
[terraform]:       ~ version                = "1.21" -> (known after apply)
[terraform]:         # (6 unchanged attributes hidden)
[terraform]:
[terraform]:
[terraform]:       ~ update_config {
[terraform]:           ~ max_unavailable            = 1 -> (known after apply)
[terraform]:           ~ max_unavailable_percentage = 0 -> (known after apply)
[terraform]:         }
[terraform]:         # (1 unchanged block hidden)
[terraform]:     }
[terraform]:
[terraform]:   # module.kubernetes.aws_eks_node_group.main[2] must be replaced
[terraform]: -/+ resource "aws_eks_node_group" "main" {
[terraform]:       ~ arn                    = "arn:aws:eks:eu-west-2:892486800165:nodegroup/qhubawsdslc-dev/worker/f2bf2c01-b695-d752-dff8-df37ec98f1ab" -> (known after apply)
[terraform]:       ~ capacity_type          = "ON_DEMAND" -> (known after apply)
[terraform]:       ~ disk_size              = 20 -> 50 # forces replacement
[terraform]:       ~ id                     = "qhubawsdslc-dev:worker" -> (known after apply)
[terraform]:       - labels                 = {} -> null
[terraform]:       + node_group_name_prefix = (known after apply)
[terraform]:       ~ release_version        = "1.21.5-20220112" -> (known after apply)
[terraform]:       ~ resources              = [
[terraform]:           - {
[terraform]:               - autoscaling_groups              = [
[terraform]:                   - {
[terraform]:                       - name = "eks-worker-f2bf2c01-b695-d752-dff8-df37ec98f1ab"
[terraform]:                     },
[terraform]:                 ]
[terraform]:               - remote_access_security_group_id = ""
[terraform]:             },
[terraform]:         ] -> (known after apply)
[terraform]:       ~ status                 = "ACTIVE" -> (known after apply)
[terraform]:       ~ subnet_ids             = [
[terraform]:           - "subnet-0063ecc4391bfbca7",
[terraform]:           - "subnet-0aede967b72f0907b",
[terraform]:         ] -> (known after apply) # forces replacement
[terraform]:         tags                   = {
[terraform]:             "Environment"                           = "dev"
[terraform]:             "Owner"                                 = "terraform"
[terraform]:             "Project"                               = "qhubawsdslc"
[terraform]:             "kubernetes.io/cluster/qhubawsdslc-dev" = "shared"
[terraform]:         }
[terraform]:       ~ version                = "1.21" -> (known after apply)
[terraform]:         # (6 unchanged attributes hidden)
[terraform]:
[terraform]:
[terraform]:       ~ update_config {
[terraform]:           ~ max_unavailable            = 1 -> (known after apply)
[terraform]:           ~ max_unavailable_percentage = 0 -> (known after apply)
[terraform]:         }
[terraform]:         # (1 unchanged block hidden)
[terraform]:     }
```
</details>